/*
임시로 작성된 열거형입니다. 

DOT 계산방식
각 도트뎀마다 턴을 따로 공유하는듯 합니다. [ 같은 중독이라도 ]
데미지를 계산할 땐 한번에 계산하는거 같습니다.
기본적으로 도트뎀은 3턴을 기본인듯 합니다.
 */

public enum EEffectType
{
    None = 0,

    // 즉발형
    Damage,
    Heal,
    Stress,

    // 도트뎀 [ 일단 동일한 매커니즘 같습니다. ]
    Bleed,
    Blight,
    Burn,

    // 버프목록
    Crit,               // 치명타     [ 다음 공격 100% 치명타 ]
    Riposte,            // 반격       [ 공격 받을 때 반격 ]
    Dodge,              // 회피       [ 다음 공격 50% 회피 ]
    DodgePlus,          // 회피+      [ 다음 공격 75% 회피 ]
    Block,              // 방어       [ 다음 공격피해 50% 감소 ]
    BlockPlus,          // 방어+      [ 다음 공격피해 75% 감소 ]
    Guarded,            // 보호       [ 아군 대신 피격 ]
    Strength,           // 힘         [ 공격 피해 50% 증가 ]
    Speed,              // 속도       [ 행동 속도 증가 ]
    Stealth,            // 은신       [ 대상 지정 공격에 영향을 줌 ]

    // 디버프 목록
    Daze,               // 현기증     [이번 행동이 라운드의 마지막으로 밀림]
    Stun,               // 기절       [이번 행동 상실, 다음 1턴간 기절 저항 +50%]
    Blind,              // 실명       [ 50% 확률로 빗나감 ]
    Weak,               // 약화       [ 공격 피해 50% 감소 ]
    Vulnerable,         // 취약       [ 받는 공격 피해 50% 증가 ]
    Taunt,              // 도발       [ 적이 가능하면 해당 대상을 무조건 공격함 ]
    Immobilize,         // 이동불가   [ 모든 이동 효과 무시 ]

    // 특수 토큰
    Combo,              // 연계       [ 대상 효과를 가진 기술에 추가 효과 ]
                         
                        
    // 이거말고도 더 많은데 일단 여기까지...
}

